app/controllers/products_controller.rb

SELECT "products".* FROM "products"
SELECT "products".* FROM "products" WHERE "products"."user_id" = $1 ORDER BY title ASC  [["user_id", 1]]
---
  def index
    @products = Product.all
    @products = @products.where(user_id: current_user)        #products onde (user_id == current_user), exibe somente produtos que pertencem ao current_user

SELECT "products".* FROM "products" WHERE (UPPER(products.title) like '%3GS%') ORDER BY title ASC
SELECT "products".* FROM "products" WHERE "products"."category_id" = $1 ORDER BY title ASC  [["category_id", 2]]
---
  def homepage
    @products = Product.all
    @products = @products.where(category: params[:category_id]) unless params[:category_id].blank?

INSERT INTO "products" ("title", "description", "price", "created_at", "updated_at", "user_id", "category_id", "images") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @product = Product.new(product_params)
    @product.user = current_user #define que o novo produto criado pertecente ao usuario atual da sessão que criou o produto

    respond_to do |format|
      if @product.save

UPDATE "products" SET "images" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["images", "[\"3gs1.jpg\",\"3gs2.jpg\",\"3gs3.jpg\"]"], ["updated_at", "2018-07-04 09:59:55.606145"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)