app/views/products/_form.html.erb

    <label>Categoria do Produto</label>
    <%= form.select :category_id, Category.all.collect {|category| [category.description, category.id]}, :class => "form-control" %>
---
SELECT "categories".* FROM "categories"