app/views/products/homepage.html.erb

    <ul>
      <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"